ErpTest/src/Catalogs/пкПультыДляПодъемников/пкПультыДляПодъемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>пкПультыДляПодъемников</name>
  <comment>Справочник содержит информацию о пультах, которые используются при работе с подъемниками</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тариф</name>
    <comment>Стоимость услуги ремонта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УслугаПредоставляется</name>
    <comment>Определяет, выводится тариф на услугу в договор</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПульта</name>
    <type>
      <types>CatalogRef.пкТипыПультов</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/InformationRegisters/пкНомерПультаПоПрефиксу/пкНомерПультаПоПрефиксу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкНомерПультаПоПрефиксу</name>
  <resources>
    <name>ТекущийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Префикс</name>
    <type>
      <types>EnumRef.пкПрефиксыПультовДляПодъемников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкПрефиксыПультовДляПодъемников/пкПрефиксыПультовДляПодъемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкПрефиксыПультовДляПодъемников</name>
  <enumValues>
    <name>PMD</name>
  </enumValues>
  <enumValues>
    <name>PNND</name>
  </enumValues>
  <enumValues>
    <name>PEKBD</name>
  </enumValues>
  <enumValues>
    <name>PEKBE</name>
  </enumValues>
  <enumValues>
    <name>PNNE</name>
  </enumValues>
  <enumValues>
    <name>PRDD</name>
  </enumValues>
  <enumValues>
    <name>PRDE</name>
  </enumValues>
  <enumValues>
    <name>PSD</name>
  </enumValues>
  <enumValues>
    <name>PSE</name>
  </enumValues>
  <enumValues>
    <name>PSJ</name>
  </enumValues>
  <enumValues>
    <name>PTD</name>
  </enumValues>
  <enumValues>
    <name>PTE</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/пкПультыДляПодъемников/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Префикс = Перечисления.пкПрефиксыПультовДляПодъемников.PTE;
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьКод(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		Объект.Код = СгенерироватьКодНаСервере(Префикс); 	
	КонецЕсли;  
КонецПроцедуры

&НаСервереБезКонтекста
Функция СгенерироватьКодНаСервере(рсПрефикс)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Префикс", рсПрефикс);	
	ТекущийНомер = РегистрыСведений.пкНомерПультаПоПрефиксу.Получить(Отбор).ТекущийНомер;
	ТекущийНомер = Макс(ТекущийНомер, 1);
	рсПрефиксСтрокой = "" + рсПрефикс;	
	
	Пока Истина Цикл
		
		Если ТекущийНомер > 999 Тогда
			ПроверяемыйКод = рсПрефиксСтрокой + ТекущийНомер;
		Иначе
			ПроверяемыйКод = рсПрефиксСтрокой + Формат(ТекущийНомер, "ЧЦ=3; ЧВН=");		
		КонецЕсли;
		
		ПроверяемыйОбъект = Справочники.пкПультыДляПодъемников.НайтиПоКоду(ПроверяемыйКод);		
		
		Если ПроверяемыйОбъект = Справочники.пкПультыДляПодъемников.ПустаяСсылка() Тогда
			Прервать;		
		КонецЕсли; 
		
		ТекущийНомер = ТекущийНомер + 1;
		
	КонецЦикла;
	
	ЗапистьНомера = РегистрыСведений.пкНомерПультаПоПрефиксу.СоздатьМенеджерЗаписи();
	ЗапистьНомера.Префикс = рсПрефикс;	
	ЗапистьНомера.ТекущийНомер = ТекущийНомер;
	ЗапистьНомера.Записать(Истина);
		
	Возврат ПроверяемыйКод;

КонецФункции
